# macOS package set for fresh bootstraps.
# Apply with: brew bundle --file=Brewfile

# Taps
tap "d12frosted/emacs-plus"
tap "nikitabobko/tap"

# Shell
brew "stow"
brew "coreutils"   # gls, used by zsh/aliases.zsh
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "awk"
brew "ripgrep"
brew "tree"

# Git
brew "gh"

# Build
brew "make"
brew "automake"
brew "cmake"
brew "llvm"
brew "bear"

# Dev utilities
brew "just"
brew "mkcert"
brew "websocat"
brew "rclone"

# Containers
brew "docker"
brew "docker-compose"
brew "colima"
brew "podman-compose"
brew "helm"

# Emacs
brew "d12frosted/emacs-plus/emacs-plus@31",
     args: ["with-debug", "with-xwidgets", "with-imagemagick", "with-dbus", "with-mailutils"]

# Writing
brew "pandoc"
brew "typst"
brew "tinymist"

# Media
brew "ffmpeg"

# Apps
cask "ghostty"
cask "aerospace"
cask "1password-cli"

# Fonts
cask "font-iosevka"
